CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПредприятия</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПредприятия.Resource.КоличествоЧасов</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПредприятия.Dimension.День</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоказательРасчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

CalculationRegisters/Начисления/Ext/RecordSetModule.bsl
Процедура РассчитатьСуммуНачисления() Экспорт	
	ДнейБольничногоЗаСчетРаботодателя = 3;
	Для Каждого Движение Из ЭтотОбъект Цикл
		
		Если Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад Тогда
			Оклад = Движение.ПоказательРасчета;
			ОтработаноЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия).Итог("КоличествоЧасов");
			НормаЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия).Итог("КоличествоЧасов");
			РезультатРасчета = Оклад * ОтработаноЧасов / НормаЧасов;
			Движение.Сумма = РезультатРасчета;
			ЭтотОбъект.Записать(,Истина);
		ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный Тогда
			Оклад = Движение.ПоказательРасчета;
			СтоимостьДняПоБолезни = Оклад * 24 / 730;
			КоличествоДнейБолезни = (КонецДня(Движение.ПериодДействияКонец)+1 - Движение.ПериодДействияНачало)/86400;
			Движение.Сумма = КоличествоДнейБолезни * СтоимостьДняПоБолезни;
			ЭтотОбъект.Записать(,Истина);
		ИначеЕсли Движение.ВидРасчета.Предопределенный = Ложь Тогда
			СуммаРасчета = Неопределено;
			ФормулаРасчета = Движение.ВидРасчета.ФормулаРасчета;
			Выполнить(ФормулаРасчета);
			Движение.Сумма = РезультатРасчета;
			ЭтотОбъект.Записать(,Истина);
		Иначе
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = СтрШаблон("Для вида расчета %1 не задана формула расчета!", Движение.ВидРасчета);
			СообщениеПользователю.Сообщить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
